# SlabThickness

## Description
Returns the thickness of slab objects that meet the criteria.

```pascal
FUNCTION SlabThickness(c : CRITERIA) : REAL;
```

```python

def vs.SlabThickness(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from VectorWorks12.0
## Category
* Criteria